In [3]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

url = "https://books.toscrape.com/"
response = requests.get(url)

soup = BeautifulSoup(response.text, "html.parser")

books = soup.find_all("article", class_="product_pod")

data = []

for book in books:
    title = book.h3.a["title"]
    price = book.find("p", class_="price_color").text
    rating = book.p["class"][1]   # rating text like One, Two

    data.append({
        "Title": title,
        "Price": price,
        "Rating": rating
    })

df = pd.DataFrame(data)
df

                                                Title    Price Rating
0                                A Light in the Attic  Â£51.77  Three
1                                  Tipping the Velvet  Â£53.74    One
2                                          Soumission  Â£50.10    One
3                                       Sharp Objects  Â£47.82   Four
4               Sapiens: A Brief History of Humankind  Â£54.23   Five
5                                     The Requiem Red  Â£22.65    One
6   The Dirty Little Secrets of Getting Your Dream...  Â£33.34   Four
7   The Coming Woman: A Novel Based on the Life of...  Â£17.93  Three
8   The Boys in the Boat: Nine Americans and Their...  Â£22.60   Four
9                                     The Black Maria  Â£52.15    One
10     Starving Hearts (Triangular Trade Trilogy, #1)  Â£13.99    Two
11                              Shakespeare's Sonnets  Â£20.66   Four
12                                        Set Me Free  Â£17.46   Five
13  Scott Pilgrim's Precious Little Life (Scott Pi...  Â£52.29   Five
14                          Rip it Up and Start Again  Â£35.02   Five
15  Our Band Could Be Your Life: Scenes from the A...  Â£57.25  Three
16                                               Olio  Â£23.88    One
17  Mesaerion: The Best Science Fiction Stories 18...  Â£37.59    One
18                       Libertarianism for Beginners  Â£51.33    Two
19                            It's Only the Himalayas  Â£45.17    Two

In [4]:
all_books = []

# books.toscrape.com me total 50 pages hain
for page in range(1, 51):
    url = f"https://books.toscrape.com/catalogue/page-{page}.html"
    response = requests.get(url)
    soup = BeautifulSoup(response.text, "html.parser")

    books = soup.find_all("article", class_="product_pod")

    for book in books:
        title = book.h3.a["title"]
        price = book.find("p", class_="price_color").text
        rating = book.p["class"][1]

        all_books.append({
            "Title": title,
            "Price": price,
            "Rating": rating
        })

df = pd.DataFrame(all_books)
df

                                                 Title    Price Rating
0                                 A Light in the Attic  Â£51.77  Three
1                                   Tipping the Velvet  Â£53.74    One
2                                           Soumission  Â£50.10    One
3                                        Sharp Objects  Â£47.82   Four
4                Sapiens: A Brief History of Humankind  Â£54.23   Five
..                                                 ...      ...    ...
995  Alice in Wonderland (Alice's Adventures in Won...  Â£55.53    One
996   Ajin: Demi-Human, Volume 1 (Ajin: Demi-Human #1)  Â£57.06   Four
997  A Spy's Devotion (The Regency Spies of London #1)  Â£16.97   Five
998                1st to Die (Women's Murder Club #1)  Â£53.98    One
999                 1,000 Places to See Before You Die  Â£26.08   Five

[1000 rows x 3 columns]

In [12]:
df["Price"].dtype

dtype('float64')

In [13]:
df["Price_INR"] = df["Price"] * 105
df.head()

                                   Title  Price Rating  Price_GBP  Price_INR
0                   A Light in the Attic  51.77  Three      51.77    5435.85
1                     Tipping the Velvet  53.74    One      53.74    5642.70
2                             Soumission  50.10    One      50.10    5260.50
3                          Sharp Objects  47.82   Four      47.82    5021.10
4  Sapiens: A Brief History of Humankind  54.23   Five      54.23    5694.15

In [15]:
df["Price_INR"] = df["Price_INR"].round(2)
df.head()

                                   Title  Price Rating  Price_GBP  Price_INR
0                   A Light in the Attic  51.77  Three      51.77    5435.85
1                     Tipping the Velvet  53.74    One      53.74    5642.70
2                             Soumission  50.10    One      50.10    5260.50
3                          Sharp Objects  47.82   Four      47.82    5021.10
4  Sapiens: A Brief History of Humankind  54.23   Five      54.23    5694.15

In [16]:
df_final = df[["Title", "Price_INR", "Rating"]]
df_final.head()

                                   Title  Price_INR Rating
0                   A Light in the Attic    5435.85  Three
1                     Tipping the Velvet    5642.70    One
2                             Soumission    5260.50    One
3                          Sharp Objects    5021.10   Four
4  Sapiens: A Brief History of Humankind    5694.15   Five

In [17]:
df_final.to_csv("books_dataset_INR.csv", index=False)